# Description:
#   Get a Gal Word
#
# Dependencies:
#
# Configuration:
#
# Commands:
#   hubot gal <query> - translate Japanese
#
# Author:
#   Takasuka

module.exports = (robot) ->
  robot.respond /gal (.+)/i, (msg) ->
    msg.send getGalWord(msg.match[1])

  getGalWord = (str) ->
    for i, word of base
      str = str.split(word).join(rep[i])
    return str

  base = [
    'あ', 'い', 'う', 'え', 'お',
    'か', 'き', 'く', 'け', 'こ',
    'さ', 'し', 'す', 'せ', 'そ',
    'た', 'ち', 'つ', 'て', 'と',
    'な', 'に', 'ぬ', 'ね', 'の',
    'は', 'ひ', 'ふ', 'へ', 'ほ',
    'ま', 'み', 'む', 'め', 'も',
    'や', 'ゆ', 'よ',
    'ら', 'り', 'る', 'れ', 'ろ',
    'わ', 'を', 'ん',
    'が', 'ぎ', 'ぐ', 'げ', 'ご',
    'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
    'だ', 'ぢ', 'づ', 'で', 'ど',
    'ば', 'び', 'ぶ', 'べ', 'ぼ',
    'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ'
  ]

  rep = [
    'ぁ', 'ﾚヽ', 'ぅ', 'ヱ', '才',
    'ｶゝ', '(ｷ', '＜', 'ヶ', '⊇',
    '±', '∪', '￡', '世', '`ﾉ',
    'ﾅ=', '干', '⊃', '〒', '├',
    'ﾅょ', '(ﾆ', 'ゐ', 'йё', 'σ',
    'ﾊ', '匕', 'ﾌ', 'ﾍ', 'ﾚま',
    'мα', '彡', '￡′', '〆', 'мσ',
    'ゃ', 'ゅ', 'ょ',
    'яа', 'l)', 'ゑ', 'яё', 'з',
    'ゎ', 'щo', 'ω',
    'ｶゝ〃', '(ｷ〃', '＜〃', 'ヶ〃', '⊇〃',
    '±〃', '∪〃', '￡〃', '世〃', '`ﾉ〃',
    'ﾅ=〃', '干〃', '⊃〃', '〒〃', '├〃',
    'ﾊ〃', '匕〃', 'ﾌ〃', 'ﾍ〃', 'ﾚま〃',
    'ﾊo', '匕o', 'ﾌo', 'ﾍo', 'ﾚまo'
  ]

